#include<bits/stdc++.h>
using namespace std;
int main() {
    int n, m;
    int x1, y1, x2, y2; 
    int dx1, dy1, dx2, dy2;
    int t;
    cin>>n>>m; 
    cin >> x1 >> y1 >> x2 >> y2; 
    cin >> dx1 >> dy1 >> dx2 >> dy2;
    cin >> t; //不要用回圈來做思考,因為只有一行數字要輸入而已
    for(int i=0;i<t;i++){
        x1+=dx1;
        y1+=dy1;
        x2+=dx2;
        y2+=dy2;
        
        //記得要用一個“＝”
        //處理x
        if(x1<0){//左牆
            dx1=-dx1;//-1==>1
            x1=-x1;//-1==>1
        }
        else if(x1>n){//超過邊界右牆
            dx1=-dx1;//1==>-1
            x1=2*n-x1;//原本21,20==>多了1=>2*20-21,避免變成負的
        }
        //處理y
        if(y1<0){//上牆
            dy1=-dy1;//-1==>1
            y1=-y1;//-1==>1
        }
        else if(y1>m){//超過邊界下牆
            dy1=-dy1;//1==>-1
            y1=2*m-y1;//原本21,20==>多了1(假設）=>避免出界
        }
        
        //換顆球再來一次
        if(x2<0){//左牆
            dx2=-dx2;//-1==>1
            x2=-x2;//-1==>1
        }
        else if(x2>n){//超過邊界右牆
            dx2=-dx2;//1==>-1
            x2=2*n-x2;//原本21,20==>多了x2=>2*20-21,避免變成負的
        }
        //處理y
        if(y2<0){//上牆
            dy2=-dy2;//-1==>1
            y2=-y2;//-1==>1
        }
        else if(y2>m){//超過邊界下牆
            dy2=-dy2;//1==>-1
            y2=2*m-y2;//原本21,20==>多了y2=>避免出界
        }
        //看看是否需要互換速度唷～座標相同的話則swap des
        if(x1==x2&&y1==y2){
            swap(dx1,dx2);
            swap(dy1,dy2);//白癡喔...座標不是要改的,要改的是“速度”啊啊啊
        }
        
    }
    cout<<x1<<' '<<y1<<' '<<x2<<' '<<y2;
}